Revit 2026 API

# TextNodeFontHeight Property

---

Height [ft] of the text font, in model space.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double FontHeight { get; }
```
```vb
Public ReadOnly Property FontHeight As Double
	Get
```
```cpp
public:
property double FontHeight {
	double get ();
}
```
```fsharp
member FontHeight : float with get
```

#### Property Value

Double

This is the height of the 'M' glyph in the text font.

#### Reference

TextNode Class

Autodesk.Revit.DB Namespace